# Задача 1- Напишите функцию sum(start, end), которая суммирует все целые числа от значения «start» до
#величины «end» включительно. Если пользователь задаст первое число большее чем второе,
#просто поменяйте их местами.

# Задача 2- Реализуйте функцию time2min(h, m), которая переводит часы и минуты в минуты с начала
#суток (00:00)

# Задача 3- Реализуйте функцию min2time(mm), которая минуты с начала суток переводит в часы и минуты
#(для показа на электронных часах).

# Задача 4- Электричка отправляется в h1:m1 и едет h2:m2. Выведите время прибытия электрички на
#электронных часах в формате hh:mm.Формат входных данных: на одной строке h1:m1, на другой h2:m2


# Задача 5- Электричка отправляется в h1:m1 и прибывает в h2:m2. Выведите время в пути электрички в
#формате hh:mm.

# Задача 6- Функция принимает год (натуральное число). Напечатайте YES, если год високосный. Иначе
#напечатайте NO

# Задача 7- Функция принимает год (натуральное число). Напечатайте YES, если год високосный. Иначе
#напечатайте NO/ Год високосный, если он делится на 4, но не делится на 100. Если год делится на 400, то он
#тоже считается високосным.

