#Колонтитул: [СОКРАЩЕННЫЙ ЗАГОЛОВОК ДО 50 СИМВОЛОВ] 1
#Написать мини-конспект по теме:
#1) Join-ы, виды и что они делают
#2) 6 нормальных форм базы данных
#Cоздать базу данных для массажного сервиса с таблицами клиент, услуги, заказ:
# 1) У заказа есть клиент и название услуги (используем Foreign Key)
#2) У клиента и услуги произвольные поля, но важно чтобы присутствовал Primary Key
#Для решения этой задачи используем классовый подход
#Cоздать таблицу с животными:
#1) Вывести всех животных старше 2 лет используя LEFT JOIN
#2) Вывести животных старше 3 лет используя INNER JOIN
#3) Вывести животных мужского пола используя любой из джоинов