#  модель процесса обучения
# Обьекты - ученик, учитель, знания
# Ученик и учитель имеют общий базовый класс - человек
# Обьекты должны уметь увеличить знания
# Ученик должен брать информацию и превращать в знания
# У учителя есть группа учеников
# Данные представляют из себя список знаний. Элементы извлекаются по индексу

class Person:
    #метод
    def say(self, message):
        print(message)
        
    def say_hi(self):
          self.say_hi 
anna = Person #объект, экземпляр класса
anna.say_hi()